NinhPham2712/IoT-Based-Climate-Control-System/STM32IDE_TRANSMITTER/CORE/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Delay_Us(uint32_t us);
void Delay_Ms(uint32_t ms);
void Buzzer_Trigger(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BUZZER_BUTTON_Pin GPIO_PIN_1
#define BUZZER_BUTTON_GPIO_Port GPIOA
#define BUZZER_BUTTON_EXTI_IRQn EXTI1_IRQn
#define INC_BUTTON_Pin GPIO_PIN_2
#define INC_BUTTON_GPIO_Port GPIOA
#define INC_BUTTON_EXTI_IRQn EXTI2_IRQn
#define DES_BUTTON_Pin GPIO_PIN_3
#define DES_BUTTON_GPIO_Port GPIOA
#define DES_BUTTON_EXTI_IRQn EXTI3_IRQn
#define RELAY_BUTTON_Pin GPIO_PIN_4
#define RELAY_BUTTON_GPIO_Port GPIOA
#define RELAY_BUTTON_EXTI_IRQn EXTI4_IRQn
#define DHT22_Pin GPIO_PIN_5
#define DHT22_GPIO_Port GPIOA
#define RELAY_Pin GPIO_PIN_0
#define RELAY_GPIO_Port GPIOB
#define DIO0_Pin GPIO_PIN_10
#define DIO0_GPIO_Port GPIOB
#define DIO0_EXTI_IRQn EXTI15_10_IRQn
#define RST_Pin GPIO_PIN_11
#define RST_GPIO_Port GPIOB
#define NSS_Pin GPIO_PIN_12
#define NSS_GPIO_Port GPIOB
#define MODE_BUTTON_Pin GPIO_PIN_8
#define MODE_BUTTON_GPIO_Port GPIOA
#define MODE_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define BUZZER_Pin GPIO_PIN_11
#define BUZZER_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
